gsomani/TM4C123_Lab_Assignments/Assignments/gptm_4/src/main.c
#include <stdint.h>
#include <stdio.h>
#include "inc/tm4c123gh6pm.h"
#include "pll.h"
void Timer0Capture_Init(void);
int Timer0A_periodCapture(void);     
uint32_t b[10];

void Timer0Capture_Init(void)
{
        SYSCTL_RCGCTIMER_R |= 1;        /* enable clock to Timer Block 0 */
        SYSCTL_RCGC2_R |= 2;            /* enable clock to PORTB */
        GPIO_PORTB_DIR_R &= ~0x40;      /* make PB6 an input pin */
        GPIO_PORTB_DEN_R |= 0x40;       /* make PB6 as digital pin */
        GPIO_PORTB_AFSEL_R |= 0x40;     /* use PB6 alternate function */
        GPIO_PORTB_PCTL_R &= ~0x0F000000; /* configure PB6 for T0CCP0 */
        GPIO_PORTB_PCTL_R |= 0x07000000;
     

        TIMER0_CTL_R &= ~1;             /* disable timer0A during setup */
        TIMER0_CFG_R = 4;               /* 16-bit timer mode */
        TIMER0_TAMR_R = 0x17;           /* up-count, edge-time, capture mode */
        TIMER0_CTL_R &= ~0x0C;          /* capture the rising edge */
        TIMER0_CTL_R |= 1;              /* enable timer0A */
}

    int Timer0A_periodCapture(void)

    {
        int lastEdge, thisEdge;
    /* capture the first rising edge */
        TIMER0_ICR_R = 4;               /* clear timer0A capture flag */
        while((TIMER0_RIS_R & 4) == 0)
            ;                           /* wait till captured */

        lastEdge = TIMER0_TAR_R;        /* save the timestamp */
        /* capture the second rising edge */
        TIMER0_ICR_R = 4;               /* clear timer0A capture flag */
        while((TIMER0_RIS_R & 4) == 0);                           /* wait till captured */
        thisEdge = TIMER0_TAR_R;        /* save the timestamp */
        return (thisEdge - lastEdge) & 0x00FFFFFF; /* return the time difference */

    }
  
    int main (void)

    {
      int period;long int period_ns;
      PLL_Init();	
      Timer0Capture_Init();
printf("%s\n%s\n%s\n%d\n",__DATE__,__TIME__,__FILE__,__LINE__);

      while(1) {
            period = Timer0A_periodCapture();
	    period_ns=(period*25)/2;		
            printf("%ld\n", period_ns);
        }

    }